FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/DN_СформироватьЗаявкуНаРасходДСПоАктамСверкиКСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>DN_СформироватьЗаявкуНаРасходДСПоАктамСверкиКСО</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>В регистре хранятся курсы валют по дням</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>Курс валюты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>Кратность валюты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ТТ_СтатусыЗаявкиНаРасходДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТТ_СтатусыЗаявкиНаРасходДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВплане</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/DN_СформироватьЗаявкуНаРасходДСПоАктамСверкиКСО/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Функция ЗаполненыОбязательныеПоля()

	Если ЗначениеЗаполнено(Организация) и ЗначениеЗаполнено(Контрагент) и ЗначениеЗаполнено(ДоговорыВзаиморасчетов) тогда
		Возврат Истина;
	Иначе
		Предупреждение("Сначало заполните обязательные поля");
		Возврат Ложь;
	КонецЕсли;	

КонецФункции // ЗаполненыОбязательныеПоля()

&НаКлиенте
Процедура Заполнить(Команда)
	Если НЕ ЗаполненыОбязательныеПоля() тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьНаСервере()
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере() 	
		
	Список.Очистить();
	Итого = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	DN_АВ_КредитноСтраховыеСделки.АктСверки КАК АктСверки
		|ИЗ
		|	РегистрСведений.DN_АВ_КредитноСтраховыеСделки КАК DN_АВ_КредитноСтраховыеСделки
		|ГДЕ
		|	DN_АВ_КредитноСтраховыеСделки.АктСверки <> ЗНАЧЕНИЕ(Документ.DN_АктСверкиКредитСтрах.ПустаяСсылка)
		|	И DN_АВ_КредитноСтраховыеСделки.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктСверкиСтраховой)
		|	И DN_АВ_КредитноСтраховыеСделки.Организация = &Организация
		|	И DN_АВ_КредитноСтраховыеСделки.Контрагент = &Контрагент
		|	И DN_АВ_КредитноСтраховыеСделки.ДоговорыВзаиморасчетов = &ДоговорыВзаиморасчетов
		|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.Дата МЕЖДУ &ДатаНачала И &ДатаОкончание
		|	И DN_АВ_КредитноСтраховыеСделки.ЗаявкаНаРасходДС = ЗНАЧЕНИЕ(Документ.ЗаявкаНаРасходДС.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ДоговорыВзаиморасчетов",ДоговорыВзаиморасчетов);
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончание) тогда
		ДатаОкончание = ТекущаяДата();
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончание",КонецДня(ДатаОкончание));
	
	Если ЗначениеЗаполнено(ПодразделенияКомпании) тогда
		Запрос.Текст = Запрос.Текст + "
		|	И DN_АВ_КредитноСтраховыеСделки.ПодразделенияКомпании = &ПодразделенияКомпании";
		Запрос.УстановитьПараметр("ПодразделенияКомпании",ПодразделенияКомпании);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаАктаСверки) тогда
		Запрос.Текст = Запрос.Текст + "
		|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.НаДату МЕЖДУ &ДатаАктаНачало и &ДатаАктаОкончание";
		Запрос.УстановитьПараметр("ДатаАктаНачало",НачалоДня(ДатаАктаСверки));
		Запрос.УстановитьПараметр("ДатаАктаОкончание",КонецДня(ДатаАктаСверки));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерАктаСверки) тогда
		Запрос.Текст = Запрос.Текст + "
		|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.НомерАкта = &НомерАкта";
		Запрос.УстановитьПараметр("НомерАкта",НомерАктаСверки);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Список.Добавить();
		НоваяСтрока.АктСверкиКСО = Выборка.АктСверки.Ссылка;
		НоваяСтрока.АвторДокумента = Выборка.АктСверки.АвторПоледнейЗаписи;
		СуммаКПеречислению = 0;
		Для каждого Строка из НоваяСтрока.АктСверкиКСО.РабочиеЛисты Цикл
			Если Строка.Удержание тогда
				СуммаКПеречислению = СуммаКПеречислению + Строка.Нетто-Строка.Расхождение;
				Итого = Итого + Строка.Нетто-Строка.Расхождение;
			Иначе
				СуммаКПеречислению = СуммаКПеречислению + Строка.Брутто;
				Итого = Итого + Строка.Брутто;
			КонецЕсли;
		КонецЦикла;
		НоваяСтрока.СуммаКПеречислению = СуммаКПеречислению;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаРасходДС(Команда)

	Если НЕ Список.Количество() тогда
		Предупреждение("Сначало заполните табличную часть");
		Возврат;
	КонецЕсли;
	
	Форма = ПолучитьФорму("Документ.ЗаявкаНаРасходДС.ФормаОбъекта");
	ДанныеФормы = Форма.ЭтотОбъект;
	ДанныеФормы.ХозОперация = Справочники.ХозОперации.ЗаявкаНаРасходСРС;
	ДанныеФормы.Дата = ТекущаяДата();
	ДанныеФормы.Автор = ПараметрыСеанса.Пользователь;
	ДанныеФормы.ВалютаДокумента = ДоговорыВзаиморасчетов.ВалютаВзаиморасчетов;
	ДанныеФормы.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов;
	ДанныеФормы.СтруктурнаяЕдиница = Организация.ОсновнойБанковскийСчет;
	ДанныеФормы.Контрагент = Контрагент;
	ДанныеФормы.КурсДокумента = ПолучитьКурс(ДанныеФормы.ВалютаДокумента);
	
	Назначение = "Согласно Актов сверки от " + Контрагент; 
	Для Каждого Строка из Список цикл
		ДатаАкта = Формат(Строка.АктСверкиКСО.ДатаАкта, "ДЛФ=D");
		Назначение = Назначение + "
		|Акт сверки номер " + Строка.АктСверкиКСО.НомерАкта + " от " + ДатаАкта; 
	КонецЦикла;
	
	ДанныеФормы.Назначение = Назначение;	
	ДанныеФормы.Организация = Организация;
	
	//<<ЧалапАю Бизтех 05.07.2024    
	//ДанныеФормы.ПодразделениеКомпании = ПодразделенияКомпании;  
	Если ЗначениеЗаполнено(ПодразделенияКомпании) тогда
		ДанныеФормы.ПодразделениеКомпании = ПодразделенияКомпании;   
	иначе
		ДанныеФормы.ПодразделениеКомпании = ДанныеФормы.ДоговорВзаиморасчетов.Подразделение
	КонецЕсли;     
	//ЧалапАю Бизтех 05.07.2024   >>
	
	ДанныеФормы.СтатьяДДС = Контрагент.DN_СтатьяДДС;
	ДанныеФормы.СуммаДокумента = Итого;
	ДанныеФормы.КурсВалютыУпр = ДанныеФормы.КурсДокумента; 
	ДанныеФормы.КурсВалютыВзаиморасчетов = ДоговорыВзаиморасчетов.ВалютаВзаиморасчетов;
	ДанныеФормы.ДатаСоздания = ТекущаяДата();
	ДанныеФормы.СчетКонтрагента = Контрагент.ОсновнойБанковскийСчет;
	ДанныеФормы.СтатусТТ = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Заявка;
	
	НоваяСтрока = ДанныеФормы.Платежи.Добавить();
	НоваяСтрока.ДатаПлатежа = ТекущаяДата();
	НоваяСтрока.СтатьяРасходов = Контрагент.DN_СтатьяРасходовКСО;
	
	Начало = Формат(ДатаНачала, "ДЛФ=D");
	Конец = Формат(ДатаОкончание, "ДЛФ=D");
	
	НоваяСтрока.Описание = "Согласно Актов сверки КСО с " + Контрагент + " за период от " + Начало + " до " + Конец;	
	НоваяСтрока.Сумма = Итого;
	
	Форма.ЭлементыФормы.ДействияФормы.Кнопки.Список.Пометка = Ложь;
	Форма.ОткрытьМодально();
	//Форма.Записать(); 
	
	
	Движение = РегистрыСведений.DN_АВ_КредитноСтраховыеСделки;
    Записи = Движение.СоздатьНаборЗаписей();

	Для Каждого Строка из Список Цикл
		
		Для Каждого Лист из Строка.АктСверкиКСО.РабочиеЛисты цикл
			РабочийЛист = Лист.СсылкаНаРабочийЛист;
			Записи.Отбор.Регистратор.Установить(РабочийЛист);
			Записи.Прочитать();
			
			Если Записи.Количество() тогда
				Для Каждого СтрокаЗаписи из Записи цикл
					Если ЗначениеЗаполнено(СтрокаЗаписи.АктСверки) тогда
						СтрокаЗаписи.ЗаявкаНаРасходДС = ДанныеФормы.Ссылка;
					КонецЕсли;
				КонецЦикла;
				Записи.Записать();
			КонецЕсли; 
		КонецЦикла;		
		АктСверки = Строка.АктСверкиКСО.ПолучитьОбъект();
		АктСверки.ЗаявкаНаРасходДС = ДанныеФормы.Ссылка;
		АктСверки.Записать(); 
	КонецЦикла; 
	
	Список.Очистить();

КонецПроцедуры // СоздатьЗаявкуНаРасходДС()

&НаСервере
Функция ПолучитьКурс(Валюта)
	
	Курс = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс КАК Курс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютСрезПоследних
		|ГДЕ
		|	КурсыВалютСрезПоследних.Валюта = &Валюта";
	
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Запрос.УстановитьПараметр("Валюта",Валюта);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Курс = Выборка.Курс;	
	КонецЦикла;
	
	Возврат Курс;
	
КонецФункции //ПолучитьКурс

&НаСервере
Процедура СписокПриИзмененииНаСервере()
	Итого = Список.Итог("СуммаКПеречислению");
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	СписокПриИзмененииНаСервере();
КонецПроцедуры
